&НаКлиентеНаСервереБезКонтекста
Функция РазбитьМассивПоПачкам(М, РазмерПачки)
	Р = Новый Массив();
	Если М.Количество() <> 0 Тогда
		Р.Добавить(Новый Массив());
	КонецЕсли;
	Для Каждого Эл Из М Цикл
		Если Р[Р.Количество() - 1].Количество() = РазмерПачки Тогда
			Р.Добавить(Новый Массив());
		КонецЕсли;
		Р[Р.Количество() - 1].Добавить(Эл);
	КонецЦикла;
	Возврат Р;
КонецФункции

&НаСервере
Функция НачатьРасчетНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	НаборПараметров = Новый Соответствие;
	// тут надо получить список продукции в выбранном периоде
	ВсяПродукция = ПолучитьСписокНоменклатурыЗаПериод(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	РазмерПачки = Цел(ВсяПродукция.Количество() / Объект.КоличествоПотоков)
		+ ?(ВсяПродукция.Количество() % Объект.КоличествоПотоков = 0, 0, 1);
	Порция = РазбитьМассивПоПачкам(ВсяПродукция, РазмерПачки);
	Для НомерПотока = 1 По Объект.КоличествоПотоков Цикл
		ПараметрыФункцииДляПотока = Новый Массив;
		ПараметрыВыполненияПорции = Новый Структура;
		ПараметрыВыполненияПорции.Вставить("НачалоПериода"           , Объект.Период.ДатаНачала);
		ПараметрыВыполненияПорции.Вставить("КонецПериода"            , Объект.Период.ДатаОкончания);
		ПараметрыВыполненияПорции.Вставить("ПринудительноПересчитать", Объект.Пересчитать);
		ПараметрыВыполненияПорции.Вставить("ОтборПоПродукции"        , Порция);
		ПараметрыВыполненияПорции.Вставить("НачалоПериода"           , Объект.Период.ДатаНачала);
		ПараметрыФункцииДляПотока.Добавить(ПараметрыВыполненияПорции);
		НаборПараметров.Вставить(НомерПотока, ПараметрыФункцииДляПотока);
	КонецЦикла;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункциюВНесколькоПотоков(
		"ikon_cost_СтруктураСебестоимостиФоновый.ПредварительныйРасчётКэшаСебестоимости",
	    НаборПараметров);
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ЗапуститьРасчет(Команда)
	ДлительнаяОперация = НачатьРасчетНаСервере();
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРасчетаНаКлиенте", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеПользователя = ПараметрыОжидания.ОповещениеПользователя;
	ОповещениеПользователя.Показать = Истина;
	ОповещениеПользователя.ОтменятьПриЗакрытииФормыВладельца = Ложь;
	ОповещениеПользователя.ВыводитьОкноОжидания = Истина;
	ОповещениеПользователя.Текст = "Выполняется расчет детализации себестоимости";
	
	ПараметрыОжидания.Заголовок = "Расчет детализации себестоимости";
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРасчетаНаКлиенте(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(РезультатВыполнения.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	ЗавершениеРасчетаНаСервере(РезультатВыполнения.АдресРезультата);
КонецПроцедуры

&НаСервере
Процедура ЗавершениеРасчетаНаСервере(АдресВременногоХранилища)
	Объект.Прогресс.Очистить();
	Для Каждого КлючЗначение Из ПолучитьИзВременногоХранилища(АдресВременногоХранилища) Цикл
		РезультатВыполнения = КлючЗначение.Значение;
		Если РезультатВыполнения.Статус = "Ошибка" Тогда
			ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(РезультатВыполнения.ИнформацияОбОшибке));
			Продолжить;
		КонецЕсли;
		ТаблицаПрогресса = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПрогресса, Объект.Прогресс);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.КоличествоПотоков = 8;
КонецПроцедуры
